public/inbox/setup-iventoy-with-isc-dhcp-server-for-pxe-boot/index.html
<!DOCTYPE html>
<html lang="en">
<head>  <meta charset="UTF-8">
  <title>Setup Iventoy With Isc Dhcp Server for Pxe Boot</title>
  <meta name="viewport" content="width=device-width, initial-scale=1">
  <link rel="stylesheet" href="/css/gtd.css">
  <link href="https://cdnjs.cloudflare.com/ajax/libs/prism/1.27.0/themes/prism-tomorrow.min.css" rel="stylesheet">
</head>
<body>
  
<main>
  <div style="margin: 1rem;">
    <a href="/" style="
      display: inline-block;
      background-color: #eee;
      color: #333;
      padding: 0.4rem 0.8rem;
      border-radius: 6px;
      text-decoration: none;
      font-weight: bold;
      font-family: sans-serif;
      font-size: 0.9rem;
    ">
      ← Homepage
    </a>

  <h1>Setup Iventoy With Isc Dhcp Server for Pxe Boot</h1>

  </div>
  <nav class="toc">
    <nav id="TableOfContents">
<ul>
<li><a href="#headline-1">Overview</a>
</li>
<li><a href="#headline-2">Setting up IVentoy PXE server</a>
</li>
<li><a href="#headline-3">Setting up the DHCP Server</a>
</li>
<li><a href="#headline-4">The end</a>
</li>
</ul>
</nav>
  </nav> 

  <article>
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
Overview
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<ol>
<li>Setup the IVentoy server</li>
<li>Setup DHCP server to handle DHCP and PXE boot options</li>
</ol>
<p>This guide assumes that these are two different servers with static IP
addresses. By the end, you&#39;ll be able to PXE boot any files placed in the ISO
folder of Ventoy.</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
Setting up IVentoy PXE server
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<p>Download and extract the latest iventoy from <a href="https://github.com/ventoy/PXE/releases">the IVentoy Github Releases</a>. I
placed the files in <code>/opt/ventoy/</code></p>
<p>
Start the Ventoy server and load the web interface. Enter the settings and set
the DHCP mode to &#34;External&#34;. Also make sure that the right network/ip range is
selected and then click the run button</p>
<div class="src src-text">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-text" data-lang="text"><span style="display:flex;"><span>/opt/ventoy/iventoy.sh -R start</span></span></code></pre></div>
</div>
<p>
After completing those steps, stop the ventoy server</p>
<div class="src src-text">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-text" data-lang="text"><span style="display:flex;"><span>/opt/ventoy/iventoy.sh stop</span></span></code></pre></div>
</div>
<p>
This is all we need to get things working on the Ventoy side of things. To
automatically start the IVentoy service, create this systemd unit file in
<code>/etc/systemd/system/iventoy.service</code></p>
<div class="src src-text">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-text" data-lang="text"><span style="display:flex;"><span>  [Unit]
</span></span><span style="display:flex;"><span>  Description=iVentoy PXE Booter
</span></span><span style="display:flex;"><span>  Documentation=https://www.iventoy.com
</span></span><span style="display:flex;"><span>  Wants=network-online.target
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>  [Service]
</span></span><span style="display:flex;"><span>  Type=forking
</span></span><span style="display:flex;"><span>  Environment=IVENTOY_API_ALL=1
</span></span><span style="display:flex;"><span>  Environment=IVENTOY_AUTO_RUN=1
</span></span><span style="display:flex;"><span>  Environment=LIBRARY_PATH=/opt/iventoy/lib/lin64
</span></span><span style="display:flex;"><span>  Environment=LD_LIBRARY_PATH=/opt/iventoy/lib/lin64
</span></span><span style="display:flex;"><span>  ExecStart=/opt/iventoy/lib/iventoy
</span></span><span style="display:flex;"><span>  WorkingDirectory=/opt/iventoy
</span></span><span style="display:flex;"><span>  Restart=on-failure
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>  [Install]
</span></span><span style="display:flex;"><span>  WantedBy=multi-user.target</span></span></code></pre></div>
</div>
<p>
Now enable and start the service.</p>
<div class="src src-bash">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-bash" data-lang="bash"><span style="display:flex;"><span>  systemctl daemon-reload
</span></span><span style="display:flex;"><span>  systemctl enable --now iventoy.service
</span></span><span style="display:flex;"><span>  <span style="color:#75715e"># Making sure its running</span>
</span></span><span style="display:flex;"><span>  /opt/ventoy/iventoy.sh status</span></span></code></pre></div>
</div>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
Setting up the DHCP Server
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<p><strong>Important note</strong>: Make sure DHCP is disabled on your router after setting this
up. If you have any errors saying &#34;No subnet declaration for INTERFACE&#34; when
running <code>journalctl -u isc-dhcp-server</code>, the
problem is that you either dont have your interface specified in
<code>/etc/default/isc-dhcp-server</code> or there is a syntax error in the
dhcpd.conf. In my experience the error logging has been amibigious and not user
friendly.</p>
<p>
Okay, with that out of the way, lets install it!</p>
<div class="src src-bash">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-bash" data-lang="bash"><span style="display:flex;"><span>  apt install isc-dhcp-server</span></span></code></pre></div>
</div>
<p>
Add the line <code>INTERFACE=YOUR_INTERFACE</code> to /etc/default/isc-dhcp-server. Uncomment the
lines at the bottom named <code>INTERFACES</code>.</p>
<div class="src src-text">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-text" data-lang="text"><span style="display:flex;"><span>  # Defaults for isc-dhcp-server (sourced by /etc/init.d/isc-dhcp-server)
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>  # Path to dhcpd&#39;s config file (default: /etc/dhcp/dhcpd.conf).
</span></span><span style="display:flex;"><span>  #DHCPDv4_CONF=/etc/dhcp/dhcpd.conf
</span></span><span style="display:flex;"><span>  #DHCPDv6_CONF=/etc/dhcp/dhcpd6.conf
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>  # Path to dhcpd&#39;s PID file (default: /var/run/dhcpd.pid).
</span></span><span style="display:flex;"><span>  #DHCPDv4_PID=/var/run/dhcpd.pid
</span></span><span style="display:flex;"><span>  #DHCPDv6_PID=/var/run/dhcpd6.pid
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>  # Additional options to start dhcpd with.
</span></span><span style="display:flex;"><span>  #       Don&#39;t use options -cf or -pf here; use DHCPD_CONF/ DHCPD_PID instead
</span></span><span style="display:flex;"><span>  #OPTIONS=&#34;&#34;
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>  # On what interfaces should the DHCP server (dhcpd) serve DHCP requests?
</span></span><span style="display:flex;"><span>  #       Separate multiple interfaces with spaces, e.g. &#34;eth0 eth1&#34;.
</span></span><span style="display:flex;"><span>  INTERFACES=&#34;eth0&#34;
</span></span><span style="display:flex;"><span>  #INTERFACESv4=&#34;eth0&#34;
</span></span><span style="display:flex;"><span>  #INTERFACESv6=&#34;&#34;</span></span></code></pre></div>
</div>
<p>
Now edit /etc/dhcp/dhcpd.conf. This template creates a DHCP server to handout
addresses for the 192.168.50.0/24 network. Change the network IP to reflect your
own. Edit the address for <code>next-server</code> and <code>tftp-server-name</code> to point to your
IVentoy server instead.</p>
<div class="src src-bash">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-bash" data-lang="bash"><span style="display:flex;"><span>    ddns-update-style none;
</span></span><span style="display:flex;"><span>    authoritative;
</span></span><span style="display:flex;"><span>    deny declines;
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>    subnet 192.168.50.0 netmask 255.255.255.0 <span style="color:#f92672">{</span>
</span></span><span style="display:flex;"><span>     authoritative;
</span></span><span style="display:flex;"><span>     range 192.168.50.100 192.168.50.200;
</span></span><span style="display:flex;"><span>     default-lease-time 3600;
</span></span><span style="display:flex;"><span>     max-lease-time 3600;
</span></span><span style="display:flex;"><span>     option subnet-mask 255.255.255.0;
</span></span><span style="display:flex;"><span>     option broadcast-address 192.168.50.255;
</span></span><span style="display:flex;"><span>     option routers 192.168.50.1;
</span></span><span style="display:flex;"><span>     option domain-name-servers 8.8.8.8;
</span></span><span style="display:flex;"><span>     <span style="color:#75715e"># For iPXE:</span>
</span></span><span style="display:flex;"><span>     next-server 192.168.50.53;
</span></span><span style="display:flex;"><span>     <span style="color:#75715e"># For HyperV guests:</span>
</span></span><span style="display:flex;"><span>     option dhcp-client-identifier <span style="color:#e6db74">&#34;PXEClient&#34;</span>; <span style="color:#75715e">#option 60</span>
</span></span><span style="display:flex;"><span>     option tftp-server-name <span style="color:#e6db74">&#34;192.168.50.53&#34;</span>; <span style="color:#75715e">#option 66</span>
</span></span><span style="display:flex;"><span>     option bootfile-name <span style="color:#e6db74">&#34;iventoy_loader_16000&#34;</span>; <span style="color:#75715e">#option 67</span>
</span></span><span style="display:flex;"><span>     <span style="color:#75715e">#option vendor-class-identifier &#34;PXEClient&#34;;</span>
</span></span><span style="display:flex;"><span>
</span></span><span style="display:flex;"><span>  <span style="color:#f92672">}</span></span></span></code></pre></div>
</div>
<p>
Turn off DHCP on your router and start the services on the server.</p>
<div class="src src-bash">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-bash" data-lang="bash"><span style="display:flex;"><span>  systemctl enable --now isc-dhcp-server</span></span></code></pre></div>
</div>
</div>
</div>
<div id="outline-container-headline-4" class="outline-2">
<h2 id="headline-4">
The end
</h2>
<div id="outline-text-headline-4" class="outline-text-2">
<p>You&#39;re clients will now be able to PXE boot! I tested this on Hyper-V and KVM
guest machines. This will work with UEFI and BIOS clients at the same time.</p>
</div>
</div>

  </article>
</main>

</body>
</html>
